```
[command]/home/runner/work/_temp/a7ad6005-a455-4705-8bf4-6135ee2b639b/terraform-bin plan -no-color
data.aws_organizations_organization.current: Reading...
module.aws-iam-identity-center.data.aws_ssoadmin_instances.sso_instance: Reading...
aws_cloudformation_stack.terraform-mgmt: Refreshing state... [id=arn:aws:cloudformation:us-east-1:176207359176:stack/terraform-default/1c536a60-08e0-11ef-8a40-0e2c06793a51]
aws_cloudformation_stack_set.github-actions: Refreshing state... [id=github-actions-stackset]
aws_organizations_organization.org: Refreshing state... [id=o-1naruu1w9c]
aws_cloudformation_stack.github-actions: Refreshing state... [id=arn:aws:cloudformation:us-east-1:176207359176:stack/github-actions/a5cdab10-09b3-11ef-ba76-0afff27c6b41]
aws_cloudformation_stack_set.terraform: Refreshing state... [id=terraform-default-stackset]
module.aws-iam-identity-center.data.aws_ssoadmin_instances.sso_instance: Read complete after 0s [id=us-east-1]
module.aws-iam-identity-center.aws_ssoadmin_permission_set.pset["ViewOnlyAccess"]: Refreshing state... [id=arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18,arn:aws:sso:::instance/ssoins-72231415576aa1f8]
module.aws-iam-identity-center.aws_ssoadmin_permission_set.pset["AdministratorAccess"]: Refreshing state... [id=arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8]
aws_organizations_organizational_unit.sandbox: Refreshing state... [id=ou-wual-2920gzcm]
aws_organizations_organizational_unit.suspended: Refreshing state... [id=ou-wual-e50l22ou]
aws_organizations_organizational_unit.security: Refreshing state... [id=ou-wual-boby66op]
aws_organizations_organizational_unit.tech: Refreshing state... [id=ou-wual-2g63jyq1]
aws_cloudformation_stack_set_instance.github-actions: Refreshing state... [id=github-actions-stackset,r-wual,us-east-1]
aws_cloudformation_stack_set_instance.terraform: Refreshing state... [id=terraform-default-stackset,r-wual,us-east-1]
data.aws_organizations_organization.current: Read complete after 1s [id=o-1naruu1w9c]
data.aws_organizations_organizational_units.all_ous: Reading...
data.aws_organizations_organizational_units.all_ous: Read complete after 0s [id=r-wual]
data.aws_organizations_organizational_unit_child_accounts.security_accounts: Reading...
data.aws_organizations_organizational_unit_child_accounts.security_accounts: Read complete after 0s [id=ou-wual-boby66op]
module.aws-iam-identity-center.data.aws_identitystore_group.identity_store_group["AWS"]: Reading...
module.aws-iam-identity-center.data.aws_identitystore_group.identity_store_group["AWS"]: Read complete after 0s [id=7408d478-c081-704c-a299-771014510d92]
module.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:767397827008"]: Refreshing state... [id=7408d478-c081-704c-a299-771014510d92,GROUP,767397827008,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8]
module.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:176207359176"]: Refreshing state... [id=7408d478-c081-704c-a299-771014510d92,GROUP,176207359176,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8]
module.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:ViewOnlyAccess__Account:767397827008"]: Refreshing state... [id=7408d478-c081-704c-a299-771014510d92,GROUP,767397827008,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18,arn:aws:sso:::instance/ssoins-72231415576aa1f8]
module.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:ViewOnlyAccess__Account:058264333162"]: Refreshing state... [id=7408d478-c081-704c-a299-771014510d92,GROUP,058264333162,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18,arn:aws:sso:::instance/ssoins-72231415576aa1f8]
module.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:058264333162"]: Refreshing state... [id=7408d478-c081-704c-a299-771014510d92,GROUP,058264333162,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8]
module.aws-iam-identity-center.aws_ssoadmin_managed_policy_attachment.pset_aws_managed_policy["ViewOnlyAccess.arn:aws:iam::aws:policy/job-function/ViewOnlyAccess"]: Refreshing state... [id=arn:aws:iam::aws:policy/job-function/ViewOnlyAccess,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18,arn:aws:sso:::instance/ssoins-72231415576aa1f8]
module.aws-iam-identity-center.aws_ssoadmin_managed_policy_attachment.pset_aws_managed_policy["AdministratorAccess.arn:aws:iam::aws:policy/AdministratorAccess"]: Refreshing state... [id=arn:aws:iam::aws:policy/AdministratorAccess,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudformation_stack.github-actions will be updated in-place
  ~ resource "aws_cloudformation_stack" "github-actions" {
      ~ capabilities       = [
          - "CAPABILITY_IAM",
          + "CAPABILITY_NAMED_IAM",
        ]
        id                 = "arn:aws:cloudformation:us-east-1:176207359176:stack/github-actions/a5cdab10-09b3-11ef-ba76-0afff27c6b41"
        name               = "github-actions"
      ~ outputs            = {
          - "ServiceRoleARN" = "arn:aws:iam::176207359176:role/github-actions-GitHubActionsServiceRole-BwQR0UB8GquE"
        } -> (known after apply)
        tags               = {}
      ~ tags_all           = {
          + "stack"   = "organization"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_cloudformation_stack.terraform-mgmt will be updated in-place
  ~ resource "aws_cloudformation_stack" "terraform-mgmt" {
        id                 = "arn:aws:cloudformation:us-east-1:176207359176:stack/terraform-default/1c536a60-08e0-11ef-8a40-0e2c06793a51"
        name               = "terraform-default"
      ~ outputs            = {} -> (known after apply)
        tags               = {}
      ~ tags_all           = {
          + "stack"   = "organization"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudformation_stack_set.github-actions will be updated in-place
  ~ resource "aws_cloudformation_stack_set" "github-actions" {
        id                      = "github-actions-stackset"
        name                    = "github-actions-stackset"
      ~ parameters              = {
          - "AudienceList"            = "sts.amazonaws.com" -> null
          - "Path"                    = "/" -> null
            # (3 unchanged elements hidden)
        }
        tags                    = {}
      ~ tags_all                = {
          + "stack"   = "organization"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_cloudformation_stack_set.terraform will be updated in-place
  ~ resource "aws_cloudformation_stack_set" "terraform" {
        id                      = "terraform-default-stackset"
        name                    = "terraform-default-stackset"
        tags                    = {}
      ~ tags_all                = {
          + "stack"   = "organization"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_organizations_organizational_unit.sandbox will be updated in-place
  ~ resource "aws_organizations_organizational_unit" "sandbox" {
        id        = "ou-wual-2920gzcm"
        name      = "Sandbox"
        tags      = {}
      ~ tags_all  = {
          + "stack"   = "organization"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_organizations_organizational_unit.security will be updated in-place
  ~ resource "aws_organizations_organizational_unit" "security" {
        id        = "ou-wual-boby66op"
        name      = "Security"
        tags      = {}
      ~ tags_all  = {
          + "stack"   = "organization"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_organizations_organizational_unit.suspended will be updated in-place
  ~ resource "aws_organizations_organizational_unit" "suspended" {
        id        = "ou-wual-e50l22ou"
        name      = "Suspended"
        tags      = {}
      ~ tags_all  = {
          + "stack"   = "organization"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_organizations_organizational_unit.tech will be updated in-place
  ~ resource "aws_organizations_organizational_unit" "tech" {
        id        = "ou-wual-2g63jyq1"
        name      = "Tech"
        tags      = {}
      ~ tags_all  = {
          + "stack"   = "organization"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.aws-iam-identity-center.data.aws_ssoadmin_permission_set.existing_permission_sets["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:058264333162"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssoadmin_permission_set" "existing_permission_sets" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-72231415576aa1f8"
      + name             = "AdministratorAccess"
      + relay_state      = (known after apply)
      + session_duration = (known after apply)
      + tags             = (known after apply)
    }

  # module.aws-iam-identity-center.data.aws_ssoadmin_permission_set.existing_permission_sets["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:176207359176"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssoadmin_permission_set" "existing_permission_sets" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-72231415576aa1f8"
      + name             = "AdministratorAccess"
      + relay_state      = (known after apply)
      + session_duration = (known after apply)
      + tags             = (known after apply)
    }

  # module.aws-iam-identity-center.data.aws_ssoadmin_permission_set.existing_permission_sets["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:767397827008"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssoadmin_permission_set" "existing_permission_sets" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-72231415576aa1f8"
      + name             = "AdministratorAccess"
      + relay_state      = (known after apply)
      + session_duration = (known after apply)
      + tags             = (known after apply)
    }

  # module.aws-iam-identity-center.data.aws_ssoadmin_permission_set.existing_permission_sets["Type:GROUP__Principal:AWS__Permission:ViewOnlyAccess__Account:058264333162"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssoadmin_permission_set" "existing_permission_sets" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-72231415576aa1f8"
      + name             = "ViewOnlyAccess"
      + relay_state      = (known after apply)
      + session_duration = (known after apply)
      + tags             = (known after apply)
    }

  # module.aws-iam-identity-center.data.aws_ssoadmin_permission_set.existing_permission_sets["Type:GROUP__Principal:AWS__Permission:ViewOnlyAccess__Account:767397827008"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssoadmin_permission_set" "existing_permission_sets" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-72231415576aa1f8"
      + name             = "ViewOnlyAccess"
      + relay_state      = (known after apply)
      + session_duration = (known after apply)
      + tags             = (known after apply)
    }

  # module.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:058264333162"] must be replaced
-/+ resource "aws_ssoadmin_account_assignment" "account_assignment" {
      ~ id                 = "7408d478-c081-704c-a299-771014510d92,GROUP,058264333162,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8" -> (known after apply)
      ~ permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:176207359176"] must be replaced
-/+ resource "aws_ssoadmin_account_assignment" "account_assignment" {
      ~ id                 = "7408d478-c081-704c-a299-771014510d92,GROUP,176207359176,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8" -> (known after apply)
      ~ permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:767397827008"] must be replaced
-/+ resource "aws_ssoadmin_account_assignment" "account_assignment" {
      ~ id                 = "7408d478-c081-704c-a299-771014510d92,GROUP,767397827008,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8" -> (known after apply)
      ~ permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:ViewOnlyAccess__Account:058264333162"] must be replaced
-/+ resource "aws_ssoadmin_account_assignment" "account_assignment" {
      ~ id                 = "7408d478-c081-704c-a299-771014510d92,GROUP,058264333162,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18,arn:aws:sso:::instance/ssoins-72231415576aa1f8" -> (known after apply)
      ~ permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:ViewOnlyAccess__Account:767397827008"] must be replaced
-/+ resource "aws_ssoadmin_account_assignment" "account_assignment" {
      ~ id                 = "7408d478-c081-704c-a299-771014510d92,GROUP,767397827008,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18,arn:aws:sso:::instance/ssoins-72231415576aa1f8" -> (known after apply)
      ~ permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.aws-iam-identity-center.aws_ssoadmin_permission_set.pset["AdministratorAccess"] will be updated in-place
  ~ resource "aws_ssoadmin_permission_set" "pset" {
        id               = "arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8"
        name             = "AdministratorAccess"
        tags             = {
            "ManagedBy" = "Terraform"
        }
      ~ tags_all         = {
          + "stack"     = "organization"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.aws-iam-identity-center.aws_ssoadmin_permission_set.pset["ViewOnlyAccess"] will be updated in-place
  ~ resource "aws_ssoadmin_permission_set" "pset" {
        id               = "arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18,arn:aws:sso:::instance/ssoins-72231415576aa1f8"
        name             = "ViewOnlyAccess"
        tags             = {
            "ManagedBy" = "Terraform"
        }
      ~ tags_all         = {
          + "stack"     = "organization"
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

Plan: 5 to add, 10 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_organizations_organization.current: Reading...%0Amodule.aws-iam-identity-center.data.aws_ssoadmin_instances.sso_instance: Reading...%0Aaws_cloudformation_stack.terraform-mgmt: Refreshing state... [id=arn:aws:cloudformation:us-east-1:176207359176:stack/terraform-default/1c536a60-08e0-11ef-8a40-0e2c06793a51]%0Aaws_cloudformation_stack_set.github-actions: Refreshing state... [id=github-actions-stackset]%0Aaws_organizations_organization.org: Refreshing state... [id=o-1naruu1w9c]%0Aaws_cloudformation_stack.github-actions: Refreshing state... [id=arn:aws:cloudformation:us-east-1:176207359176:stack/github-actions/a5cdab10-09b3-11ef-ba76-0afff27c6b41]%0Aaws_cloudformation_stack_set.terraform: Refreshing state... [id=terraform-default-stackset]%0Amodule.aws-iam-identity-center.data.aws_ssoadmin_instances.sso_instance: Read complete after 0s [id=us-east-1]%0Amodule.aws-iam-identity-center.aws_ssoadmin_permission_set.pset["ViewOnlyAccess"]: Refreshing state... [id=arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18,arn:aws:sso:::instance/ssoins-72231415576aa1f8]%0Amodule.aws-iam-identity-center.aws_ssoadmin_permission_set.pset["AdministratorAccess"]: Refreshing state... [id=arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8]%0Aaws_organizations_organizational_unit.sandbox: Refreshing state... [id=ou-wual-2920gzcm]%0Aaws_organizations_organizational_unit.suspended: Refreshing state... [id=ou-wual-e50l22ou]%0Aaws_organizations_organizational_unit.security: Refreshing state... [id=ou-wual-boby66op]%0Aaws_organizations_organizational_unit.tech: Refreshing state... [id=ou-wual-2g63jyq1]%0Aaws_cloudformation_stack_set_instance.github-actions: Refreshing state... [id=github-actions-stackset,r-wual,us-east-1]%0Aaws_cloudformation_stack_set_instance.terraform: Refreshing state... [id=terraform-default-stackset,r-wual,us-east-1]%0Adata.aws_organizations_organization.current: Read complete after 1s [id=o-1naruu1w9c]%0Adata.aws_organizations_organizational_units.all_ous: Reading...%0Adata.aws_organizations_organizational_units.all_ous: Read complete after 0s [id=r-wual]%0Adata.aws_organizations_organizational_unit_child_accounts.security_accounts: Reading...%0Adata.aws_organizations_organizational_unit_child_accounts.security_accounts: Read complete after 0s [id=ou-wual-boby66op]%0Amodule.aws-iam-identity-center.data.aws_identitystore_group.identity_store_group["AWS"]: Reading...%0Amodule.aws-iam-identity-center.data.aws_identitystore_group.identity_store_group["AWS"]: Read complete after 0s [id=7408d478-c081-704c-a299-771014510d92]%0Amodule.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:767397827008"]: Refreshing state... [id=7408d478-c081-704c-a299-771014510d92,GROUP,767397827008,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8]%0Amodule.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:176207359176"]: Refreshing state... [id=7408d478-c081-704c-a299-771014510d92,GROUP,176207359176,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8]%0Amodule.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:ViewOnlyAccess__Account:767397827008"]: Refreshing state... [id=7408d478-c081-704c-a299-771014510d92,GROUP,767397827008,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18,arn:aws:sso:::instance/ssoins-72231415576aa1f8]%0Amodule.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:ViewOnlyAccess__Account:058264333162"]: Refreshing state... [id=7408d478-c081-704c-a299-771014510d92,GROUP,058264333162,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18,arn:aws:sso:::instance/ssoins-72231415576aa1f8]%0Amodule.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:058264333162"]: Refreshing state... [id=7408d478-c081-704c-a299-771014510d92,GROUP,058264333162,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8]%0Amodule.aws-iam-identity-center.aws_ssoadmin_managed_policy_attachment.pset_aws_managed_policy["ViewOnlyAccess.arn:aws:iam::aws:policy/job-function/ViewOnlyAccess"]: Refreshing state... [id=arn:aws:iam::aws:policy/job-function/ViewOnlyAccess,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18,arn:aws:sso:::instance/ssoins-72231415576aa1f8]%0Amodule.aws-iam-identity-center.aws_ssoadmin_managed_policy_attachment.pset_aws_managed_policy["AdministratorAccess.arn:aws:iam::aws:policy/AdministratorAccess"]: Refreshing state... [id=arn:aws:iam::aws:policy/AdministratorAccess,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # aws_cloudformation_stack.github-actions will be updated in-place%0A  ~ resource "aws_cloudformation_stack" "github-actions" {%0A      ~ capabilities       = [%0A          - "CAPABILITY_IAM",%0A          + "CAPABILITY_NAMED_IAM",%0A        ]%0A        id                 = "arn:aws:cloudformation:us-east-1:176207359176:stack/github-actions/a5cdab10-09b3-11ef-ba76-0afff27c6b41"%0A        name               = "github-actions"%0A      ~ outputs            = {%0A          - "ServiceRoleARN" = "arn:aws:iam::176207359176:role/github-actions-GitHubActionsServiceRole-BwQR0UB8GquE"%0A        } -> (known after apply)%0A        tags               = {}%0A      ~ tags_all           = {%0A          + "stack"   = "organization"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # aws_cloudformation_stack.terraform-mgmt will be updated in-place%0A  ~ resource "aws_cloudformation_stack" "terraform-mgmt" {%0A        id                 = "arn:aws:cloudformation:us-east-1:176207359176:stack/terraform-default/1c536a60-08e0-11ef-8a40-0e2c06793a51"%0A        name               = "terraform-default"%0A      ~ outputs            = {} -> (known after apply)%0A        tags               = {}%0A      ~ tags_all           = {%0A          + "stack"   = "organization"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # aws_cloudformation_stack_set.github-actions will be updated in-place%0A  ~ resource "aws_cloudformation_stack_set" "github-actions" {%0A        id                      = "github-actions-stackset"%0A        name                    = "github-actions-stackset"%0A      ~ parameters              = {%0A          - "AudienceList"            = "sts.amazonaws.com" -> null%0A          - "Path"                    = "/" -> null%0A            # (3 unchanged elements hidden)%0A        }%0A        tags                    = {}%0A      ~ tags_all                = {%0A          + "stack"   = "organization"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_cloudformation_stack_set.terraform will be updated in-place%0A  ~ resource "aws_cloudformation_stack_set" "terraform" {%0A        id                      = "terraform-default-stackset"%0A        name                    = "terraform-default-stackset"%0A        tags                    = {}%0A      ~ tags_all                = {%0A          + "stack"   = "organization"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (10 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_organizations_organizational_unit.sandbox will be updated in-place%0A  ~ resource "aws_organizations_organizational_unit" "sandbox" {%0A        id        = "ou-wual-2920gzcm"%0A        name      = "Sandbox"%0A        tags      = {}%0A      ~ tags_all  = {%0A          + "stack"   = "organization"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # aws_organizations_organizational_unit.security will be updated in-place%0A  ~ resource "aws_organizations_organizational_unit" "security" {%0A        id        = "ou-wual-boby66op"%0A        name      = "Security"%0A        tags      = {}%0A      ~ tags_all  = {%0A          + "stack"   = "organization"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # aws_organizations_organizational_unit.suspended will be updated in-place%0A  ~ resource "aws_organizations_organizational_unit" "suspended" {%0A        id        = "ou-wual-e50l22ou"%0A        name      = "Suspended"%0A        tags      = {}%0A      ~ tags_all  = {%0A          + "stack"   = "organization"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # aws_organizations_organizational_unit.tech will be updated in-place%0A  ~ resource "aws_organizations_organizational_unit" "tech" {%0A        id        = "ou-wual-2g63jyq1"%0A        name      = "Tech"%0A        tags      = {}%0A      ~ tags_all  = {%0A          + "stack"   = "organization"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.aws-iam-identity-center.data.aws_ssoadmin_permission_set.existing_permission_sets["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:058264333162"] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_ssoadmin_permission_set" "existing_permission_sets" {%0A      + arn              = (known after apply)%0A      + created_date     = (known after apply)%0A      + description      = (known after apply)%0A      + id               = (known after apply)%0A      + instance_arn     = "arn:aws:sso:::instance/ssoins-72231415576aa1f8"%0A      + name             = "AdministratorAccess"%0A      + relay_state      = (known after apply)%0A      + session_duration = (known after apply)%0A      + tags             = (known after apply)%0A    }%0A%0A  # module.aws-iam-identity-center.data.aws_ssoadmin_permission_set.existing_permission_sets["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:176207359176"] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_ssoadmin_permission_set" "existing_permission_sets" {%0A      + arn              = (known after apply)%0A      + created_date     = (known after apply)%0A      + description      = (known after apply)%0A      + id               = (known after apply)%0A      + instance_arn     = "arn:aws:sso:::instance/ssoins-72231415576aa1f8"%0A      + name             = "AdministratorAccess"%0A      + relay_state      = (known after apply)%0A      + session_duration = (known after apply)%0A      + tags             = (known after apply)%0A    }%0A%0A  # module.aws-iam-identity-center.data.aws_ssoadmin_permission_set.existing_permission_sets["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:767397827008"] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_ssoadmin_permission_set" "existing_permission_sets" {%0A      + arn              = (known after apply)%0A      + created_date     = (known after apply)%0A      + description      = (known after apply)%0A      + id               = (known after apply)%0A      + instance_arn     = "arn:aws:sso:::instance/ssoins-72231415576aa1f8"%0A      + name             = "AdministratorAccess"%0A      + relay_state      = (known after apply)%0A      + session_duration = (known after apply)%0A      + tags             = (known after apply)%0A    }%0A%0A  # module.aws-iam-identity-center.data.aws_ssoadmin_permission_set.existing_permission_sets["Type:GROUP__Principal:AWS__Permission:ViewOnlyAccess__Account:058264333162"] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_ssoadmin_permission_set" "existing_permission_sets" {%0A      + arn              = (known after apply)%0A      + created_date     = (known after apply)%0A      + description      = (known after apply)%0A      + id               = (known after apply)%0A      + instance_arn     = "arn:aws:sso:::instance/ssoins-72231415576aa1f8"%0A      + name             = "ViewOnlyAccess"%0A      + relay_state      = (known after apply)%0A      + session_duration = (known after apply)%0A      + tags             = (known after apply)%0A    }%0A%0A  # module.aws-iam-identity-center.data.aws_ssoadmin_permission_set.existing_permission_sets["Type:GROUP__Principal:AWS__Permission:ViewOnlyAccess__Account:767397827008"] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_ssoadmin_permission_set" "existing_permission_sets" {%0A      + arn              = (known after apply)%0A      + created_date     = (known after apply)%0A      + description      = (known after apply)%0A      + id               = (known after apply)%0A      + instance_arn     = "arn:aws:sso:::instance/ssoins-72231415576aa1f8"%0A      + name             = "ViewOnlyAccess"%0A      + relay_state      = (known after apply)%0A      + session_duration = (known after apply)%0A      + tags             = (known after apply)%0A    }%0A%0A  # module.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:058264333162"] must be replaced%0A-/+ resource "aws_ssoadmin_account_assignment" "account_assignment" {%0A      ~ id                 = "7408d478-c081-704c-a299-771014510d92,GROUP,058264333162,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8" -> (known after apply)%0A      ~ permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6" -> (known after apply) # forces replacement%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:176207359176"] must be replaced%0A-/+ resource "aws_ssoadmin_account_assignment" "account_assignment" {%0A      ~ id                 = "7408d478-c081-704c-a299-771014510d92,GROUP,176207359176,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8" -> (known after apply)%0A      ~ permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6" -> (known after apply) # forces replacement%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:AdministratorAccess__Account:767397827008"] must be replaced%0A-/+ resource "aws_ssoadmin_account_assignment" "account_assignment" {%0A      ~ id                 = "7408d478-c081-704c-a299-771014510d92,GROUP,767397827008,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8" -> (known after apply)%0A      ~ permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6" -> (known after apply) # forces replacement%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:ViewOnlyAccess__Account:058264333162"] must be replaced%0A-/+ resource "aws_ssoadmin_account_assignment" "account_assignment" {%0A      ~ id                 = "7408d478-c081-704c-a299-771014510d92,GROUP,058264333162,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18,arn:aws:sso:::instance/ssoins-72231415576aa1f8" -> (known after apply)%0A      ~ permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18" -> (known after apply) # forces replacement%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.aws-iam-identity-center.aws_ssoadmin_account_assignment.account_assignment["Type:GROUP__Principal:AWS__Permission:ViewOnlyAccess__Account:767397827008"] must be replaced%0A-/+ resource "aws_ssoadmin_account_assignment" "account_assignment" {%0A      ~ id                 = "7408d478-c081-704c-a299-771014510d92,GROUP,767397827008,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18,arn:aws:sso:::instance/ssoins-72231415576aa1f8" -> (known after apply)%0A      ~ permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18" -> (known after apply) # forces replacement%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.aws-iam-identity-center.aws_ssoadmin_permission_set.pset["AdministratorAccess"] will be updated in-place%0A  ~ resource "aws_ssoadmin_permission_set" "pset" {%0A        id               = "arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-906c74cf88d5c0c6,arn:aws:sso:::instance/ssoins-72231415576aa1f8"%0A        name             = "AdministratorAccess"%0A        tags             = {%0A            "ManagedBy" = "Terraform"%0A        }%0A      ~ tags_all         = {%0A          + "stack"     = "organization"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.aws-iam-identity-center.aws_ssoadmin_permission_set.pset["ViewOnlyAccess"] will be updated in-place%0A  ~ resource "aws_ssoadmin_permission_set" "pset" {%0A        id               = "arn:aws:sso:::permissionSet/ssoins-72231415576aa1f8/ps-8684103603293b18,arn:aws:sso:::instance/ssoins-72231415576aa1f8"%0A        name             = "ViewOnlyAccess"%0A        tags             = {%0A            "ManagedBy" = "Terraform"%0A        }%0A      ~ tags_all         = {%0A          + "stack"     = "organization"%0A            # (3 unchanged elements hidden)%0A        }%0A        # (5 unchanged attributes hidden)%0A    }%0A%0APlan: 5 to add, 10 to change, 5 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
```
<!-- Sticky Pull Request Comment### Terraform Plan Results -->